Repository: MarkTebault/scormy-public
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

# textIntro
source: Easily create a SCORM course
de: Erstellen Sie ganz einfach einen SCORM-Kurs
es: Cree fácilmente un curso SCORM
fr: Créez facilement un cours SCORM

# btnCreateCourse
source: Create Course
de: Kurs erstellen
es: Crear curso
fr: Créer un cours

# btnLoading
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement...

# labelYTUrlField
source: YouTube Share URL
de: YouTube-Freigabe-URL
es: URL compartida de YouTube
fr: URL de partage YouTube

# hintUrlField
source: https://www.example.com
de: https://www.domain.com
es: https://www.domain.com
fr: https://www.domain.com

# errorInvalidYTUrl
source: Invalid Share URL
de: Ungültige Freigabe-URL
es: URL para compartir no válida
fr: URL de partage non valide

# textCopyUrl
source: Copy the Share URL from YouTube, then click the
de: Kopieren Sie die Freigabe-URL von YouTube und klicken Sie dann auf die
es: Copie la URL para compartir de YouTube, luego haga clic en el
fr: Copiez l'URL de partage de YouTube, puis cliquez sur le

# textCopyUrlPart2
source: button to Paste the URL.
de: Schaltfläche zum Einfügen der URL.
es: botón para pegar la URL.
fr: bouton pour coller l'URL.

# textOrEnterUrl
source: Or enter the URL exactly as it appears in the YouTube Share URL field.
de: Oder geben Sie die URL genau so ein, wie sie im Feld YouTube Share URL angezeigt wird.
es: O ingrese la URL exactamente como aparece en el campo URL compartida de YouTube.
fr: Ou saisissez l'URL exactement telle qu'elle apparaît dans le champ URL de partage YouTube.

# btnStartOver
source: Start Over
de: Von vorn anfangen
es: Comenzar de nuevo
fr: Recommencer

# labelTitlelField
source: Course Title
de: Kursname
es: Título del curso
fr: Titre de cours

# hintTitleslField
source: Title
de: Titel
es: Título
fr: Titre

# labelEmbedField
source: Embed Code
de: Code Einbetten
es: Código de Inserción
fr: Code Intégré

# hintEmbedField
source: Embed Code is HTML copied from your source
de: Einbettungscode ist HTML, das von Ihrer Quelle kopiert wurde
es: El código de inserción es HTML copiado de su fuente
fr: Le code d'intégration est du code HTML copié à partir de votre source

# btnContinue
source: Continue
de: Fortsetzen
es: Continuar
fr: Continuer

# errorRequired
source: Required
de: Erforderlich
es: Necesario
fr: Champs obligatoires

# errorMaxLength
source: Maximum length is 255 characters
de: Die maximale Länge beträgt 255 Zeichen
es: La longitud máxima es de 255 caracteres.
fr: La longueur maximale est de 255 caractères

# errorInvalidUrl
source: Must start with https:// or https://
de: Doit commencer par https:// ou https://
es: Debe comenzar con https:// o https://
fr: Doit commencer par https:// ou https://

# errorInvalidEmbed
source: Must start with an iframe tag
de: Doit commencer par une balise iframe
es: Debe comenzar con una etiqueta iframe
fr: Doit commencer par une balise iframe

# btnInstructions
source: Instructions
de: Anleitung
es: instrucciones

# textEnterTitle
source: Enter a Course Title
de: Geben Sie einen Kurstitel ein
es: Introduce un título de curso
fr: Entrez un titre de cours

# textSetPercent
source: Required for credit
de: Erforderlich für Kredit
es: Requerido para crédito
fr: Requis pour le crédit

# textFindVideo
source: Open YouTube in a browser or the YouTube App. Find the video you wish to use as a course and click the SHARE button below the video
de: Öffne YouTube in einem Browser oder der YouTube-App. Suchen Sie das Video, das Sie als Kurs verwenden möchten, und klicken Sie auf die Schaltfläche TEILEN unter dem Video
es: Abra YouTube en un navegador o en la aplicación de YouTube. Encuentre el video que desea usar como curso y haga clic en el botón COMPARTIR debajo del video
fr: Ouvrez YouTube dans un navigateur ou l'application YouTube. Trouvez la vidéo que vous souhaitez utiliser comme cours et cliquez sur le bouton PARTAGER sous la vidéo

# textClickCopy
source: Click the COPY button
de: Klicken Sie auf die Schaltfläche KOPIEREN
es: Haga clic en el botón COPIAR
fr: Cliquez sur le bouton COPIER

# textCompleteProps
source: Paste or enter the SHARE URL and complete course properties
de: Fügen Sie die SHARE-URL ein oder geben Sie sie ein und vervollständigen Sie die Kurseigenschaften
es: Pegue o ingrese la URL COMPARTIDA y complete las propiedades del curso
fr: Collez ou entrez l'URL de partage et complétez les propriétés du cours

# textCourseProps
source: Course Properties
de: Kurseigenschaften
es: Propiedades del curso
fr: Propriétés du cours

# textPreparingCourse
source: Preparing course. Please wait...
de: Kurs vorbereiten. Warten Sie mal...
es: Preparando curso. Espere por favor...
fr: Cours de préparation. S'il vous plaît, attendez...

# textSaveAs
source: Save As
de: Speichern als
es: guardar como
fr: Enregistrer sous

# textPasteURL
source: Paste or enter the SHARE URL
de: Fügen Sie die SHARE-URL ein oder geben Sie sie ein
es: Pegue o ingrese la URL COMPARTIDA
fr: Collez ou entrez l'URL de partage

# textPressSave
source: Save the course
de: Speichern Sie den Kurs
es: guardar el curso
fr: Enregistrer le cours

# textPressHome
source: Press Done when complete
de: Tippen Sie auf Fertig, wenn Sie fertig sind.
es: Toca Listo cuando hayas terminado.
fr: Appuyez sur Terminé lorsque vous avez terminé

# textInstructions
source: Instructions
de: Anleitung
es: instrucciones

# emailBody
source: Your course package is attached. Import this file into your SCORM 1.2 compliant LMS.
de: Ihr Kurspaket ist beigefügt. Importieren Sie diese Datei in Ihr SCORM 1.2-kompatibles LMS.
es: Se adjunta el paquete del curso. Importe este archivo a su LMS compatible con SCORM 1.2.
fr: Votre dossier de cours est joint. Importez ce fichier dans votre LMS compatible SCORM 1.2.

# emailSubject
source: SCORMY Course Package
de: SCORMY Kurspaket
es: Paquete de cursos SCORMY
fr: Pack de cours SCORMY

# emailError
source: You must have an email client and account setup
de: Sie müssen über einen E-Mail-Client und eine Kontoeinrichtung verfügen
es: Debe tener un cliente de correo electrónico y configuración de cuenta
fr: Vous devez avoir un client de messagerie et une configuration de compte

# emailSent
source: Email sent. Check SPAM and Junk folders.
de: E-Mail gesendet. Überprüfen Sie die SPAM- und Junk-Ordner.
es: Email enviado. Revisa las carpetas de SPAM y Basura.
fr: Email envoyé. Vérifiez les dossiers SPAM et Junk.

# btnEmail
source: Email
es: Correo electrónico

# btnSave
source: Save
de: Speichern
es: Ahorrar
fr: Sauvegarder

# btnDone
source: Done
de: Fertig
es: Hecho
fr: Fait

# textInvalid
source: Invalid
de: Ungültig
es: Inválido
fr: Non valide

# btnHelp
source: Help
de: Hilfe
es: Ayuda
fr: Aider

# youtubeCourse
source: YouTube Video
es: Video de Youtube
fr: Vidéo Youtube

# embedcodeCourse
source: Embed Code
de: Code Einbetten
es: Código de Inserción
fr: Code Intégré

# textError
source: Error
fr: erreur
